{
  "home": {
    "title": "Hi. My name is Alinde.",
    "subtitle": "I'm a Fullstack Developer",
    "contact": "Contact me"
  },
  "techstack": {
    "heading": "Tech Stack",
    "description": "I have strong experience with React, TypeScript, Node.js, and Firebase to build both web and mobile applications. I use these tools to create responsive interfaces, keep the code clean and efficient, and handle real-time data. I also have experience working with both SQL and NoSQL databases such as MySQL, MongoDB, and Firebase Firestore. In addition, I've worked with Docker for containerization and built websites and plugins with PHP and WordPress. I'm also interested in AI development and have experimented with OpenAI and used the PromptLayer tool. For me, it's both fun and important to explore new tools and languages to have a wider toolbox to choose from when building my projects. That's why I'm currently learning more about C# and .NET."
  },
  "aboutMe": {
  "heading": "Who am I?",
  "paragraph1": "I’m a full-stack developer on my way into the workforce, with experience in both frontend and backend development. I love combining creativity with problem-solving to build solutions that work smoothly and look great. For me, clear code structure and a user-friendly experience go hand in hand – whether it’s ensuring the app is easy to use or making the code easy to navigate.",
  "paragraph2": "During my education and internship, I’ve worked on several projects where I’ve built functional solutions using technologies like React, React Native, TypeScript, Node.js, PHP, Firebase, and SQL/NoSQL databases. I’ve also worked on API integrations and improved user flows in mobile apps. More details can be found under MY PROJECTS.",
  "paragraph3": "My background in customer service has equipped me with valuable soft skills, like the ability to communicate effectively, listen to and understand user needs, and collaborate well in teams. I’m good at understanding what’s required to create a positive user experience and can quickly adapt to new requirements and challenges.",
  "paragraph4": "I’m excited to bring both my technical skills and customer service experience to a developer role, where I can contribute to building user-friendly and technically sustainable solutions."
},
  "projects": {
    "heading": "My Projects",
    "read_more": "Read more",
    "hittavet_description": "Thesis project. Built the frontend in React, backend in Node. Used Firebase for database and authentication. Implemented Google's Places API and a UI library (Ant Design).",
    "matrix_description": "School project: A digital phonebook with a Matrix theme.",
    "väder_description": "School project: Weather app. Utilized WeatherBit's API and the GeoLocation API. Displays weather forecasts for today and tomorrow.",
    "retrogames_description": "School project: E-commerce site with a retro gaming theme. Integrated with Stripe.",
    "swedishfika_description": "School project: E-commerce site with a Swedish fika theme. Integrated with Stripe and PostNord's API.",
    "newsletter_description": "School project: We created a platform where customers can create newsletters, and subscribers can sign up to receive newsletters created by customers.",
    "todo_description": "School project: Digital to-do list.",
    "imagesearch_description": "School project: Image search engine. Login via Auth0 is required to access search functionality. Users can save their favorite images on their personal page."

  },
  "contact": {
    "heading": "Contact",
    "title": "Let’s create something together – get in touch!",
    "namePlaceholder": "Your Name",
    "emailPlaceholder": "Your Email",
    "messagePlaceholder": "Your Message",
    "sendMessage": "Send Message",
    "message_sent": "Message sent!",
    "message_failed": "Message could not be sent. Please try again."
  },
  "menu": {
    "home": "HOME",
    "about": "ABOUT ME",
    "techstack": "TECH STACK",
    "projects": "MY PROJECTS",
    "contact": "CONTACT"
  }
}