{
  "home": {
    "title": "Hej. Jag heter Alinde.",
    "subtitle": "Fullstackutvecklare",
    "contact": "Kontakta mig",
    "postit": "Från tanke till verklighet – jag gör dina idéer levande, en kodrad och kaffekopp i taget."
  },
  "techstack": {
    "heading": "Tech Stack",
    "description": "Jag har erfarenhet av att bygga webb- och mobilapplikationer med, men inte enbart, React, TypeScript, Node.js och Firebase-plattformen. I min verktygslåda finns även både SQL- och NoSQL-databaser (MySQL, MongoDB, Firestore) och jag har skapat hemsidor i PHP och WordPress. För mig handlar utveckling om att matcha rätt verktyg med rätt uppgift – oavsett om det betyder att fördjupa mig i teknologier jag redan behärskar eller testa något helt nytt. Just nu utforskar jag C# och .NET och hur jag kan använda det som backend i React-applikationer."
  },
  "aboutMe": {
    "heading": "Vem är jag?",
    "heading2": "Erfarenhet och bakgrund",
    "paragraph1": "Jag är en fullstackutvecklare på väg ut i arbetslivet, med erfarenhet av både frontend och backendutveckling. Jag älskar att kombinera kreativitet med problemlösning för att bygga lösningar som både fungerar smidigt och ser bra ut. För mig går en tydlig kodstruktur och en användarvänlig upplevelse hand i hand – oavsett om det handlar om att säkerställa att appen är lätt att använda eller att göra koden lätt att navigera.",
    "paragraph2": "Under min utbildning och praktik har jag arbetat med flera projekt där jag byggt funktionella lösningar med teknologier som React, TypeScript, Node.js, PHP, Firebase, SQL/NoSQL-databaser och API integrationer.",
    "paragraph3": "Min bakgrund inom kundservice har gett mig värdefulla soft skills, som förmågan att kommunicera effektivt, lyssna på och förstå användarbehov samt att samarbeta bra i team. Jag är bra på att förstå vad som krävs för att skapa en positiv användarupplevelse och kan snabbt anpassa mig efter nya krav och utmaningar.",
    "paragraph4": "Jag ser fram emot att ta med både mina tekniska färdigheter och mina erfarenheter från kundservice till ett utvecklarjobb, där jag kan bidra till att skapa både användarvänliga och tekniskt hållbara lösningar."
  },
  "projects": {
    "heading": "Mina Projekt",
    "read_more": "Läs mer",
    "hittavet_description": "Examensarbete. HittaVet är en användarvänlig app som gör det enkelt att hitta veterinärkliniker baserat på namn, stad, län eller din nuvarande plats. Appen visar kliniker nära dig och prioriterar öppna kliniker, så att du alltid hittar hjälp när du behöver det.",
    "matrix_description": "Skolprojekt: En digital telefonbok med matrix-tema.",
    "väder_description": "Skolprojekt: Väderleks-app. Användning av WeatherBits API och GeoLocation API. Visar dagens och morgondagens väderprognos. ",
    "retrogames_description": "Skolprojekt: E-handelssida med retrospels-tema. Integration med Stripe",
    "swedishfika_description": "Skolprojekt: E-handelssida med retrospels-tema. Integration med Stripe och postnords API",
    "newsletter_description": "Skolprojekt: Vi skapade en sida där man som kund kan skapa nyhetsbrev, eller man som prenumerant kan signa upp till att prenumerera på kunders skapade nyhetsbrev.",
    "todo_description": "En enkel todo-app för att skapa, bocka av och ta bort uppgifter. Inga krusiduller – bara göra klart och gå vidare.",
    "imagesearch_description": "Skolprojekt: Bildsökmotor. Inlogg via auth0 för att få tillgång till att söka. Du kan sedan spara dina favoritbilder på din sida.",
    "tumbleweed_description": " Pick the Tumbleweed är ett roligt och utmanande spel där du måste fånga så många tumbleweeds som möjligt innan tiden tar slut! Ju fler du fångar, desto snabbare rullar de in. Kan du slå ditt highscore och hålla spelet vid liv?"
  },
  "contact": {
    "heading": "Kontakt",
    "title": "Låt oss skapa något tillsammans – hör av dig!",
    "namePlaceholder": "Ditt namn",
    "emailPlaceholder": "Din e-post",
    "messagePlaceholder": "Ditt meddelande",
    "sendMessage": "Skicka meddelande",
    "message_sent": "Meddelandet skickades!",
    "message_failed": "Meddelandet kunde inte skickas. Försök igen."
  },

  "menu": {
    "home": "STARTSIDA",
    "about": "OM MIG",
    "techstack": "TECH STACK",
    "projects": "MINA PROJEKT",
    "contact": "KONTAKT"
  },

  "play_me": "Ange ditt namn och klicka \"Start Game\" för att spela spelet."
}
